
# coding: utf-8

# In[20]:


# транслитерация текста грузинского на русский:
text = input()
georgian = [" ", 'ა', 'ბ', 'გ', 'დ', 'ე', 'ვ', 'ზ', 'თ', 'ი', 'კ', 'ლ', 'მ', 'ნ', 'ჲ', 'ო', 'პ', 'ჟ', 'რ', 'ს', 'ტ', 'უ', 'ფ', 'ქ', 'ღ', 'ყ', 'შ', 'ჩ', 'ც', 'ძ', 'წ', 'ჭ', 'ხ', 'ჯ', 'ჰ', ".", ",", "-", "?"]
cyrillic = [" ", "а", "б", "г", "д", "е", "в", "з", "ҭ", "и", "к", "л", "м", "н", "й", "о", "п", "ж", "р", "с", "т", "у", "ҧ", "қ", "ҕ", "ҟ", "ш", "ч", "ц", "дз", "ҵ", "ҷ", "х", "џ", "ҳ", ".", ",", "-", "?"]
d = dict(zip(georgian, cyrillic))
for letter in text:
    if letter in d:
        print(d[letter], sep= "", end = "") 
#Проверка: ართველოლოგია

